DimaFantasy/LPP/LPP_STM32G431CBTx/Core/Src/main — копия.c
        // Вызов основной логики планировщика шагов (важно для режима STEP)
        XTimerCallback(); 
        
        // Если мы в режиме ШИМ (не шаговик), управляем ключами
        if (X_MOTOR_MODE != X_MOTOR_MODE_STEP) {
            // БЕЗОПАСНОСТЬ: В начале каждого такта принудительно закрываем все ключи
						F_RESET_PIN(&g_pins[PIN_X_MO_L]);   
						F_RESET_PIN(&g_pins[PIN_X_MO_R]);
						F_RESET_PIN(&g_pins[PIN_X_MO_L_H]); 
						F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);

            // Если задана мощность (мотор должен вращаться)
            if (X_PWM_CURRENT != 0) {
                // Ждем закрытия транзисторов перед открытием противоположных
                XMotorDeadTime();
                
                // Учет полярности ШИМ из настроек
                int32_t raw_pwr = (W_X_POL_PWM == 0) ? X_PWM_CURRENT : -X_PWM_CURRENT;
                uint32_t abs_pwr = abs(raw_pwr);
                
                // Программное ограничение (не более Period)
                if (abs_pwr > 5000) abs_pwr = 5000;
                
                // Установка точки "спада" импульса в регистр сравнения
                TIM2->CCR1 = abs_pwr; 

                // Выбор схемы активации пинов в зависимости от железа
                if (X_MOTOR_MODE == X_MOTOR_MODE_TWO_PWM) { 
                    // Режим полного H-моста (переключение диагоналей)
                    if (raw_pwr > 0) { 
                        F_SET_PIN(&g_pins[PIN_X_MO_L]);   F_SET_PIN(&g_pins[PIN_X_MO_R_H]); 
                    } else { 
                        F_SET_PIN(&g_pins[PIN_X_MO_R]);   F_SET_PIN(&g_pins[PIN_X_MO_L_H]); 
                    }
                } 
                else if (X_MOTOR_MODE == X_MOTOR_MODE_ONE_PWM) { 
                    // Режим PWM + DIR (один пин шимит, второй задает направление)
                    F_SET_PIN(&g_pins[PIN_X_MO_L]); // Силовой выход
                    uint8_t dir = (raw_pwr >= 0) ? 0 : 1;
                    if (W_X_POL_DIR) dir = !dir; // Инверсия DIR если нужно
                    
                    if (dir) F_SET_PIN(&g_pins[PIN_X_MO_R]); 
                    else     F_RESET_PIN(&g_pins[PIN_X_MO_R]);
                }
            }
        }
    }

    // --- ОБРАБОТКА КОНЦА ИМПУЛЬСА (Compare Event 1) ---
    // Срабатывает, когда счетчик CNT достигает значения CCR1
    if (sr & TIM_SR_CC1IF) {
        TIM2->SR = ~TIM_SR_CC1IF; // Сбрасываем флаг
        
        // Если мы в режиме ШИМ — гасим все силовые выходы
        if (X_MOTOR_MODE != X_MOTOR_MODE_STEP) {
            F_RESET_PIN(&g_pins[PIN_X_MO_L]);   F_RESET_PIN(&g_pins[PIN_X_MO_R]);
            F_RESET_PIN(&g_pins[PIN_X_MO_L_H]); F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
        }
    }
}

/**
 * @brief Установка длительности шага для шагового двигателя
 * @param period: Значение ARR (длительность в микросекундах при PSC=169)
 */
void XTimerSet(uint16_t period) {
    if (X_MOTOR_MODE == X_MOTOR_MODE_STEP) {
        // Устанавливаем новое значение автоперезагрузки (частота шагов)
        __HAL_TIM_SET_AUTORELOAD(&htim2, period);
        // Запускаем таймер (бит CEN в CR1)
        __HAL_TIM_ENABLE(&htim2);
    }
}

/**
 * @brief Установка мощности мотора X
 * @param power: Значение от -5000 до 5000
 */
void XMotorSet(int power) {
    if (X_MOTOR_MODE == X_MOTOR_MODE_STEP) return;

    if (abs(power) < 10) power = 0; // Небольшой deadband
    
    X_PWM_CURRENT = power;

    if (power == 0) {
        // МГНОВЕННОЕ ТОРМОЖЕНИЕ
        // Сбрасываем регистр сравнения
        TIM2->CCR1 = 0;
        
        // Прямое управление регистрами BSRR для мгновенного отключения
        // Это гарантирует, что даже если прерывание опоздает, ток прервется
        F_RESET_PIN(&g_pins[PIN_X_MO_L]);
        F_RESET_PIN(&g_pins[PIN_X_MO_R]);
        F_RESET_PIN(&g_pins[PIN_X_MO_L_H]);
        F_RESET_PIN(&g_pins[PIN_X_MO_R_H]);
    } else {
        if (power > 5000)  power = 5000;
        if (power < -5000) power = -5000;
        TIM2->CCR1 = abs(power);
    }
}






// ============================================================================
// ПОДСИСТЕМА PWM LASER & LIGHT (DMA-BASED)
// ============================================================================

// Глобальные переменные для работы DMA
volatile uint32_t dma_pwm_masks[3][2] = {0}; // [Laser, LED1, LED2][SET, RESET]
uint32_t raw_pin_masks[3] = {0};             // Маски пинов (1 << N)
uint32_t LAST_LASER_FREQ = 0;                // Для защиты от повторной инициализации

/**
 * @brief Привязка физических портов к каналам DMA.
 */
void PWM_LaserLight_LinkHardware(void) {
    uint8_t target_ids[3] = { PIN_PWM_LASER, PIN_PWM_LED1, PIN_PWM_LED2 };

    for (int i = 0; i < 3; i++) {
        PIN_CFG_T *cfg = &g_pins[target_ids[i]];
        
        // Смещение каналов: DMA1_CH2...CH7 (CH1 зарезервирован под FIFO)
        DMA_Channel_TypeDef* ch_on  = (DMA_Channel_TypeDef*)((uint32_t)DMA1_Channel1 + ((i + 1) * 0x14));
        DMA_Channel_TypeDef* ch_off = (DMA_Channel_TypeDef*)((uint32_t)DMA1_Channel1 + ((i + 4) * 0x14));

        if (!cfg->used || cfg->bsrr == (uint32_t*)&GPIO_NULL_REG || cfg->bsrr == NULL) {
            ch_on->CCR &= ~DMA_CCR_EN;
            ch_off->CCR &= ~DMA_CCR_EN;
            continue;
        }

        raw_pin_masks[i] = cfg->pin;

        // Настройка адресов в регистрах DMA
        ch_on->CCR &= ~DMA_CCR_EN;
        ch_on->CPAR = (uint32_t)cfg->bsrr;
        ch_on->CMAR = (uint32_t)&dma_pwm_masks[i][0];
        ch_on->CCR |= DMA_CCR_EN;

        ch_off->CCR &= ~DMA_CCR_EN;
        ch_off->CPAR = (uint32_t)cfg->bsrr;
        ch_off->CMAR = (uint32_t)&dma_pwm_masks[i][1];
        ch_off->CCR |= DMA_CCR_EN;
    }
}

/**
 * @brief Полная инициализация таймера и DMA
 */
void SetLaserLightPWMFrequency(uint32_t freq_hz) {
    if (freq_hz == LAST_LASER_FREQ && freq_hz != 0) return;
    
    if (freq_hz == 0) { 
        TIM1->CR1 &= ~TIM_CR1_CEN; 
        LAST_LASER_FREQ = 0; 
        return; 
    }

    // 1. Включение тактирования
    __HAL_RCC_TIM1_CLK_ENABLE();
    __HAL_RCC_DMA1_CLK_ENABLE();
    __HAL_RCC_DMAMUX1_CLK_ENABLE();

    // 2. ИСПРАВЛЕННЫЙ РАСЧЕТ ЧАСТОТЫ ТАЙМЕРА (TIM1 на APB2)
    uint32_t pclk2 = HAL_RCC_GetPCLK2Freq();
    uint32_t tim_clk = pclk2;

    // Если делитель APB2 не 1, частота таймера удваивается автоматически
    if ((RCC->CFGR & RCC_CFGR_PPRE2) != RCC_CFGR_PPRE2_DIV1) {
        tim_clk = pclk2 * 2;
    }

    uint32_t arr = 100;
    // PSC = (F_clk / (F_target * (ARR + 1)))
    uint32_t psc_val = tim_clk / (freq_hz * (arr + 1));
    
