DimaFantasy/LPP/LPP_STM32G431CBTx/Core/Src/main — копия.c
    DMA1->IFCR = DMA_IFCR_CGIF1;

    DMA1_Channel1->CCR = DMA_CCR_MEM2MEM | 
                         (0x2 << DMA_CCR_PL_Pos) | 
                         (0x2 << DMA_CCR_MSIZE_Pos) | 
                         (0x2 << DMA_CCR_PSIZE_Pos) | 
                         DMA_CCR_MINC | 
                         DMA_CCR_PINC | 
                         DMA_CCR_TCIE |
                         DMA_CCR_TEIE; // Включим еще прерывание по ошибке

    HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 3, 0);
    HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);
}

// ============================================================================
// Запуск копирования (ВАЖНО: в M2M режиме CPAR = source, CMAR = destination)
// ============================================================================
void FIFO_DATA_StartDma(uint32_t src_addr, uint32_t dst_addr, uint16_t size) {
    // 1. Выключаем канал
    DMA1_Channel1->CCR &= ~DMA_CCR_EN;
    
    // Ждём полной остановки
    while(DMA1_Channel1->CCR & DMA_CCR_EN);
    
    // 2. Очищаем ВСЕ флаги канала 1
    DMA1->IFCR = DMA_IFCR_CGIF1;
    
    // 3. В режиме M2M:
    //    CPAR = источник (source)
    //    CMAR = приёмник (destination)
    DMA1_Channel1->CPAR  = src_addr;  // Источник
    DMA1_Channel1->CMAR  = dst_addr;  // Приёмник
    DMA1_Channel1->CNDTR = size;      // Количество 32-bit слов
    
    // 4. Старт DMA
    DMA1_Channel1->CCR |= DMA_CCR_EN;
}

// ============================================================================
// Обработчик прерывания
// ============================================================================
void DMA1_Channel1_IRQHandler(void) {
    uint32_t isr = DMA1->ISR;
    
    // Transfer Complete
    if (isr & DMA_ISR_TCIF1) {
        DMA1->IFCR = DMA_IFCR_CTCIF1;
        FIFO_DATA_EndDma();
    }
    
    // Transfer Error
    if (isr & DMA_ISR_TEIF1) {
        DMA1->IFCR = DMA_IFCR_CTEIF1;
        // TODO: обработка ошибки
    }
    
    // Half Transfer (на всякий случай)
    if (isr & DMA_ISR_HTIF1) {
        DMA1->IFCR = DMA_IFCR_CHTIF1;
    }
}


/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
